
        <!--手机跟随样式1-->
    <div id="foot-memu" class="aini_foot_nav">
      <ul>
        <li id="myli"> <a href="/" class="foothover"> <svg t="1684335345940" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="4362" id="mx_n_1684335345948" width="26" height="26"><path d="M384 896v-267.648C384 591.445333 417.408 554.666667 455.125333 554.666667h113.749334c37.589333 0 71.125333 36.778667 71.125333 73.685333V896h170.666667v-384a42.666667 42.666667 0 0 1 85.333333 0v396.202667c0 40.149333-42.24 73.130667-82.048 73.130666H597.333333a42.538667 42.538667 0 0 1-42.666666-42.666666v-298.666667h-85.333334v298.666667a42.666667 42.666667 0 0 1-42.666666 42.666666H204.8c-37.717333 0-76.8-34.517333-76.8-73.130666V512a42.666667 42.666667 0 0 1 85.333333 0v384h170.666667zM111.957333 417.578667l391.253334-288c3.84-2.816 13.781333-2.816 17.706666 0.085333l392.618667 288.554667a42.666667 42.666667 0 0 0 50.517333-68.736l-392.576-288.597334c-34.005333-25.002667-84.949333-25.002667-118.869333 0l-391.253333 287.957334a42.666667 42.666667 0 1 0 50.602666 68.693333z" p-id="4363" fill="#6085f2"></path></svg>
            <p>首页</p>
          </a> </li>
        <li id="myli1"> <a class="click-qiandao" href="/fenlei.php" title="捷径列表"><svg t="1684334851639" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="4440" width="26" height="26"><path d="M512 623.104h184.832v74.24H512V623.104z m-259.072 0v74.24h111.104V623.104h-111.104z m184.832-74.24V770.56h332.8V548.864h-332.8z m74.24-221.696h184.832v74.24H512v-74.24z m-259.072 0v74.24h111.104v-74.24h-111.104z m184.832-74.24V474.624h332.8V252.928h-332.8z m-258.56-73.728h665.6v666.112h-665.6V179.2z m-74.24-74.24V918.528H918.528V104.96H104.96z" p-id="4441" fill="#6085f2"></path></svg>
            <p>捷径</p>
          </a> </li>
        <li class="aini_zjbtn" id="myli2"> <a href="../update.php" rel="nofollow" data-block="666" data-position="8" target="_blank"> <em class="bg_f b_ok"></em> <span class="bg_f"> <svg t="1684335570278" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="5470" width="40" height="40"><path d="M512 0.001287c-282.769282 0-511.998713 229.229431-511.998713 511.998713 0 282.769282 229.229431 511.998713 511.998713 511.998713 282.767995 0 511.998713-229.228144 511.998713-511.998713C1023.998713 229.230718 794.767995 0.001287 512 0.001287zM748.560448 544.492778 542.994656 544.492778l0 205.560645c0 17.279887-13.946437 31.226324-31.221176 31.226324-17.279887 0-31.226324-13.946437-31.226324-31.226324L480.547156 544.492778l-205.559357 0c-17.279887 0-31.226324-13.946437-31.226324-31.226324s13.946437-31.226324 31.226324-31.226324l205.666182 0 0-205.559357c0-17.279887 13.94515-31.226324 31.219889-31.226324 17.279887 0 31.226324 13.946437 31.226324 31.226324L543.100194 482.041417l205.560645 0c17.17435 0 31.120786 13.946437 31.120786 31.226324S765.835188 544.492778 748.560448 544.492778z" fill="#6085f2" p-id="5471"></path></svg></span> </a> </li>
        <li id="myli3"> <a class="rollbar-item tap-dark" href="../post/" title="资讯教程"><svg t="1684336671299" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="2814" width="26" height="26"><path d="M388.54 960.46H216.73c-82.34 0-149.33-66.99-149.33-149.33V213.8c0-82.34 66.99-149.33 149.33-149.33h494.92c82.34 0 149.33 66.99 149.33 149.33v145.07c0 20.62-16.72 37.33-37.33 37.33s-37.33-16.72-37.33-37.33V213.8c0-41.18-33.5-74.67-74.67-74.67H216.73c-41.17 0-74.67 33.49-74.67 74.67v597.33c0 41.18 33.5 74.67 74.67 74.67h171.81c20.62 0 37.33 16.72 37.33 37.33s-16.72 37.33-37.33 37.33z" p-id="2815" fill="#6085f2"></path><path d="M669.46 344.03H258.92c-20.62 0-37.33-16.72-37.33-37.33s16.72-37.33 37.33-37.33h410.54c20.62 0 37.33 16.72 37.33 37.33s-16.71 37.33-37.33 37.33zM429.51 534.72H258.92c-20.62 0-37.33-16.72-37.33-37.33 0-20.62 16.72-37.33 37.33-37.33h170.59c20.62 0 37.33 16.72 37.33 37.33 0 20.62-16.71 37.33-37.33 37.33zM307.5 725.4h-48.58c-20.62 0-37.33-16.72-37.33-37.33s16.72-37.33 37.33-37.33h48.58c20.62 0 37.33 16.72 37.33 37.33s-16.71 37.33-37.33 37.33zM639.02 960.46c-5.09 0-10.2-1.04-15.01-3.15a37.35 37.35 0 0 1-22.11-30.22l-5.63-52.81H566.6c-20.62 0-37.33-16.72-37.33-37.33V798.7c0-20.62 16.72-37.33 37.33-37.33s37.33 16.72 37.33 37.33v0.91h25.89c19.09 0 35.1 14.4 37.12 33.38l2.28 21.38 59.16-43.73a37.419 37.419 0 0 1 22.19-7.31h138.15V570.27H603.94v69.89h189.29c20.62 0 37.33 16.72 37.33 37.33s-16.72 37.33-37.33 37.33H566.6c-20.62 0-37.33-16.72-37.33-37.33V532.94c0-20.62 16.72-37.33 37.33-37.33h359.46c20.62 0 37.33 16.72 37.33 37.33v307.73c0 20.62-16.72 37.33-37.33 37.33H762.89l-101.67 75.16a37.407 37.407 0 0 1-22.2 7.3z" p-id="2816" fill="#6085f2"></path></svg>
            <p>讨论</p>
          </a> </li>
        <li id="myli4"> <a href="../user/im.php?uid=<?php echo $uid;?>"><svg t="1684334491903" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="1473" width="26" height="26"><path d="M983.8 312.7C958 251.7 921 197 874 150c-47-47-101.8-83.9-162.7-109.7C648.2 13.5 581.1 0 512 0S375.8 13.5 312.7 40.2C251.7 66 197 102.9 150 150c-47 47-83.9 101.8-109.7 162.7C13.5 375.8 0 442.9 0 512s13.5 136.2 40.2 199.3C66 772.3 102.9 827 150 874c47 47 101.8 83.9 162.7 109.7 63.1 26.7 130.2 40.2 199.3 40.2s136.2-13.5 199.3-40.2C772.3 958 827 921 874 874c47-47 83.9-101.8 109.7-162.7 26.7-63.1 40.2-130.2 40.2-199.3s-13.4-136.2-40.1-199.3z m-55.3 375.2c-22.8 53.8-55.4 102.2-96.9 143.7s-89.9 74.1-143.7 96.9C632.2 952.1 573 964 512 964s-120.2-11.9-175.9-35.5c-53.8-22.8-102.2-55.4-143.7-96.9s-74.1-89.9-96.9-143.7C71.9 632.2 60 573 60 512s11.9-120.2 35.5-175.9c22.8-53.8 55.4-102.2 96.9-143.7s89.9-74.1 143.7-96.9C391.8 71.9 451 60 512 60s120.2 11.9 175.9 35.5c53.8 22.8 102.2 55.4 143.7 96.9s74.1 89.9 96.9 143.7C952.1 391.8 964 451 964 512s-11.9 120.2-35.5 175.9z" fill="#6085f2" p-id="1474"></path><path d="M693.2 658.2c-20.6-20.6-44.2-37.3-69.7-49.7 51.7-35.6 85.7-95.2 85.7-162.6 0-108.8-88.5-197.2-197.2-197.2s-197.2 88.5-197.2 197.2c0 67.4 34 127 85.7 162.6-25.5 12.4-49.1 29-69.7 49.7-22 22-39.5 47.2-52 74.7-9.1 19.9 5.5 42.5 27.4 42.5h0.3c11.7 0 22.3-6.9 27.2-17.6 31-67.5 99.3-114.6 178.4-114.6 79.1 0 147.4 47 178.4 114.6 4.9 10.7 15.4 17.6 27.2 17.6h0.3c21.8 0 36.4-22.6 27.4-42.5-12.7-27.5-30.2-52.8-52.2-74.7zM512 583.1c-75.6 0-137.2-61.5-137.2-137.2S436.4 308.8 512 308.8 649.2 370.3 649.2 446 587.6 583.1 512 583.1z" fill="#6085f2" p-id="1475"></path></svg>
            <p>我的</p>
          </a> </li>
      </ul>
    </div>
<script>const myButton = document.getElementById('myli');
const svgPath = myButton.querySelector('path');

myButton.addEventListener('click', () => {
  svgPath.setAttribute('fill', '#f00'); // 将填充颜色设置为红色
});
const myButton1 = document.getElementById('myli1');
const svgPath1 = myButton1.querySelector('path');

myButton1.addEventListener('click', () => {
  svgPath1.setAttribute('fill', '#f00'); // 将填充颜色设置为红色
});
const myButton2 = document.getElementById('myli2');
const svgPath2 = myButton2.querySelector('path');

myButton2.addEventListener('click', () => {
  svgPath2.setAttribute('fill', '#f00'); // 将填充颜色设置为红色
});
const myButton3 = document.getElementById('myli3');
const svgPath3 = myButton3.querySelector('path');

myButton3.addEventListener('click', () => {
  svgPath3.setAttribute('fill', '#f00'); // 将填充颜色设置为红色
});
const myButton4 = document.getElementById('myli4');
const svgPath4 = myButton4.querySelector('path');

myButton4.addEventListener('click', () => {
  svgPath4.setAttribute('fill', '#f00'); // 将填充颜色设置为红色
});
let prevScrollPos = window.pageYOffset;
window.onscroll = function() {
  const currentScrollPos = window.pageYOffset;
  if (prevScrollPos > currentScrollPos) {
    // 向上滚动
    if (window.innerWidth > 600) {
      // 屏幕宽度大于 600 像素，隐藏
      document.getElementById("foot-memu").style.display = "none";
    } else if (currentScrollPos < 200) {
      // 滚动距离小于 200 像素，始终显示
      document.getElementById("foot-memu").style.display = "block";
    } else {
      // 滚动距离大于等于 200 像素，隐藏
      document.getElementById("foot-memu").style.display = "block";
    }
  } else {
    // 向下滚动
    if (window.innerWidth > 600) {
      // 屏幕宽度大于 600 像素，隐藏
      document.getElementById("foot-memu").style.display = "none";
    } else if (currentScrollPos < 200) {
      // 滚动距离小于 200 像素，始终显示
      document.getElementById("foot-memu").style.display = "block";
    } else {
      // 滚动距离大于等于 200 像素，隐藏
      document.getElementById("foot-memu").style.display = "none";
    }
  }
  prevScrollPos = currentScrollPos;
}

</script>