<?php
include "header.php";

?>
<p>欢迎使用《<a href="https://fler.cn">捷径源</a>》（以下简称“本站”）。本站旨在为用户提供一个分享和讨论快捷指令脚本的社区。在使用本站之前，请您认真阅读以下使用条款：<br />
1.用户行为规范<br />
1.1 用户在使用本站的过程中，必须遵守国家法律法规以及本站的相关规定，不得利用本站从事任何违法、违规、侵权的行为。<br />
1.2 用户不得以任何形式干扰或试图干扰本站的正常运行，包括但不限于：利用恶意代码、网络攻击等方式破坏本站的系统、服务器等设备和网络安全；利用本站发布虚假信息、散布谣言等干扰本站正常秩序。<br />
1.3 用户在使用本站时，应当尊重其他用户的合法权益，不得发布涉及侵犯他人知识产权、隐私权、人格权等合法权益的内容；不得发布违反社会公德、道德风尚等不良信息。<br />
2.知识产权保护<br />
2.1 本站所发布的所有内容，包括但不限于文本、图片、音频、视频等均受到知识产权法律法规的保护，未经相关权利人同意，用户不得以任何形式进行复制、传播、展示。<br />
2.2 用户在使用本站时，应当尊重他人的知识产权，不得在本站发布侵犯他人知识产权的内容，如涉及侵权行为，需承担相应的法律责任。<br />
3.免责声明<br />
3.1 本站所提供的所有内容仅供参考，本站不对其准确性、可靠性、完整性、及时性做出任何保证或承诺，用户在使用本站所提供的内容时，需自行承担风险。<br />
3.2 用户在使用本站过程中可能受到来自其他用户的侵权或侵犯他人合法权益的行为，本站不承担任何法律责任。<br />
4.用户账号管理<br />
4.1 用户在注册账号时，应当提供真实、准确、完整的信息，如因用户提供的信息不真实、不准确、不完整而导致的损失，由用户自行承担。<br />
4.2 用户在使用本站服务时，应当妥善保管自己的账号和密码，不得将其转让、出借、出租或泄露给他人使用，如由此导致的任何损失由用户自行承担。<br />
5.法律适用和争议解决<br />
5.1 本使用条款的解释、效力及纠纷解决均适用中华人民共和国法律。<br />
5.2 在使用本站服务过程中产生的任何争议，用户和本站应当通过友好协商解决，协商不成的，用户和本站均有权向有管辖权的法院提起诉讼。<br />
感谢您的耐心阅读，如有任何疑问和问题，请随时联系我们。</p>

<?php include "daohang.php"; ?>
<?php include "footer.php"; ?>
